Revit 2024 API
ParameterTypeId.LightingFixtureLamp Property
 "Lamp"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId LightingFixtureLamp { get; }
Visual Basic
Public Shared ReadOnly Property LightingFixtureLamp As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ LightingFixtureLamp {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace